## ZIP

In [1]:
a = [1,3,5,7,9]
b = [2,4,6,8,10]

In [6]:
res = []
for pos in range(0,len(a)):
    res.append(a[pos] * b[pos])
res

[2, 12, 30, 56, 90]

In [11]:
res = []
for i,j in zip(a,b):
    res.append(i *j)
res

[2, 12, 30, 56, 90]

In [12]:
[i*j for i,j in zip(a,b)]

[2, 12, 30, 56, 90]

## Numpy

In [13]:
import numpy as np

a = [1,3,5,7,9]
b = [2,4,6,8,10]

na = np.array(a)
nb = np.array(b)

In [15]:
na, nb

(array([1, 3, 5, 7, 9]), array([ 2,  4,  6,  8, 10]))

In [17]:
na + nb

array([ 3,  7, 11, 15, 19])

In [18]:
na * nb

array([ 2, 12, 30, 56, 90])

In [20]:
na = np.array([1,2,3,4,5])
na

array([1, 2, 3, 4, 5])

In [21]:
na[0]

1

In [23]:
na[-1]

5

In [25]:
na[1:3]

array([2, 3])

In [27]:
na > 3

array([False, False, False,  True,  True])

In [28]:
na[na > 3]

array([4, 5])

In [29]:
na=np.array([[1,2,3,4,5],[6,7,8,9,10]])

In [30]:
na

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10]])

In [31]:
na[0,0]

1

In [32]:
na[0,:]

array([1, 2, 3, 4, 5])

In [33]:
na[:,0]

array([1, 6])

In [34]:
na.T

array([[ 1,  6],
       [ 2,  7],
       [ 3,  8],
       [ 4,  9],
       [ 5, 10]])

In [36]:
a = [1,2,3, 'qoo','oop']
na = np.array(a)
na

array(['1', '2', '3', 'qoo', 'oop'], dtype='<U11')

In [37]:
na = np.array([['frank','M',29],['mary','F',23],['tom','M',35],['ted','M',33],['jean','F',21],['lisa','F',20]])
na

array([['frank', 'M', '29'],
       ['mary', 'F', '23'],
       ['tom', 'M', '35'],
       ['ted', 'M', '33'],
       ['jean', 'F', '21'],
       ['lisa', 'F', '20']], dtype='<U5')

In [38]:
na = np.array([ ['name', 'gender', 'age'], ['frank','M',29],['mary','F',23],['tom','M',35],['ted','M',33],['jean','F',21],['lisa','F',20]])
na

array([['name', 'gender', 'age'],
       ['frank', 'M', '29'],
       ['mary', 'F', '23'],
       ['tom', 'M', '35'],
       ['ted', 'M', '33'],
       ['jean', 'F', '21'],
       ['lisa', 'F', '20']], dtype='<U6')

## Pandas

In [39]:
import pandas as pd
df = pd.DataFrame([['frank','M',29],['mary','F',23],['tom','M',35],['ted','M',33],['jean','F',21],['lisa','F',20]])
df

       0  1   2
0  frank  M  29
1   mary  F  23
2    tom  M  35
3    ted  M  33
4   jean  F  21
5   lisa  F  20

In [40]:
print(df)

       0  1   2
0  frank  M  29
1   mary  F  23
2    tom  M  35
3    ted  M  33
4   jean  F  21
5   lisa  F  20

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
0    6 non-null object
1    6 non-null object
2    6 non-null int64
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [43]:
df.columns = ['name', 'gender', 'age']
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [ ]:
https://tw.news.yahoo.com/_td-news/api/resource/IndexDataService.getExternalMediaNewsList;count=10;loadMore=true;mrs=%7B%22size%22%3A%7B%22w%22%3A220%2C%22h%22%3A128%7D%7D;newsTab=all;start=100;tag=null;usePrefetch=true?bkt=native_generalads&device=desktop&feature=videoDocking%2Cfullmodalview&intl=tw&lang=zh-Hant-TW&partner=none&prid=822gogdddnsl7&region=TW&site=news&tz=Asia%2FTaipei&ver=2.0.968&returnMeta=true
https://tw.news.yahoo.com/_td-news/api/resource/IndexDataService.getExternalMediaNewsList;count=10;loadMore=true;mrs=%7B%22size%22%3A%7B%22w%22%3A220%2C%22h%22%3A128%7D%7D;newsTab=all;start=110;tag=null;usePrefetch=true?bkt=native_generalads&device=desktop&feature=videoDocking%2Cfullmodalview&intl=tw&lang=zh-Hant-TW&partner=none&prid=822gogdddnsl7&region=TW&site=news&tz=Asia%2FTaipei&ver=2.0.968&returnMeta=true

In [48]:
import requests
news = []
for i in range(0,10):
    res = requests.get('https://tw.news.yahoo.com/_td-news/api/resource/IndexDataService.getExternalMediaNewsList;count=100;loadMore=true;mrs=%7B%22size%22%3A%7B%22w%22%3A220%2C%22h%22%3A128%7D%7D;newsTab=all;start={};tag=null;usePrefetch=true?bkt=native_generalads&device=desktop&feature=videoDocking%2Cfullmodalview&intl=tw&lang=zh-Hant-TW&partner=none&prid=822gogdddnsl7&region=TW&site=news&tz=Asia%2FTaipei&ver=2.0.968&returnMeta=true'.format(i * 10))
    news.extend(res.json()['data'])

In [51]:
import pandas
df = pandas.DataFrame(news)
df.head(3)

,content_type,id,provider_name,published_at,summary,thumbnail,title,ts_update,url
0,story,96f8ba6d-75df-33f5-b8e9-7b845c42785e,Yahoo奇摩電競,1524364360,《絕地求生》開發商 PUBG Corp 近日宣佈目前正在製作地圖選擇功能，讓玩家可以隨心所欲...,{'url': 'https://s2.yimg.com/lo/api/res/1.2/uk...,《絕地求生》開發商預告地圖選擇功能，測試伺服器搶先開放,1524364406,/%E3%80%8A%E7%B5%95%E5%9C%B0%E6%B1%82%E7%94%9F...
1,story,3cafc7df-0270-3c13-b924-712e46f51a4e,風傳媒,1524363001,美國國會轄下的「中美經濟與安全評估委員會」19日警告，由中國企業或受中國影響的企業製造的資訊...,{'url': 'https://s2.yimg.com/lo/api/res/1.2/Ph...,中美貿易戰》「中國製造」無孔不入 美國國會警告：中國資通訊科技產品暗藏國安漏洞,1524364232,/%E4%B8%AD%E7%BE%8E%E8%B2%BF%E6%98%93%E6%88%B0...
2,story,2e33526e-7590-3a2c-8680-208bbfdf6702,新頭殼,1524363946,新頭殼newtalk,NaN,不滿小屁孩用餐亂跑 狠心孕婦伸腳絆倒害腦震盪,1524364218,/%E4%B8%8D%E6%BB%BF%E5%B0%8F%E5%B1%81%E5%AD%A9...

In [50]:
df.count()

content_type     1000
id               1000
provider_name    1000
published_at     1000
summary          1000
thumbnail         543
title            1000
ts_update        1000
url              1000
dtype: int64

## Pandas Series

In [52]:
import pandas as pd
s = pd.Series([21000,18900,18000])
s

0    21000
1    18900
2    18000
dtype: int64

In [53]:
s = pd.Series([21000,18900,18000], index = ['IPhone', 'Edge S7', 'HTC M1'])
s

IPhone     21000
Edge S7    18900
HTC M1     18000
dtype: int64

In [54]:
s= pd.Series({'IPhone':21000,'Edge S7':18900,'HTC M1':18000})
s

Edge S7    18900
HTC M1     18000
IPhone     21000
dtype: int64

In [56]:
s[2]

21000

In [57]:
s[1:3]

HTC M1    18000
IPhone    21000
dtype: int64

In [58]:
s['IPhone']

21000

In [59]:
s[['IPhone', 'Edge S7']]

IPhone     21000
Edge S7    18900
dtype: int64

In [60]:
s < 20000

Edge S7     True
HTC M1      True
IPhone     False
dtype: bool

In [61]:
s[s<20000]

Edge S7    18900
HTC M1     18000
dtype: int64

In [62]:
cheap = s < 20000
cheap

Edge S7     True
HTC M1      True
IPhone     False
dtype: bool

In [63]:
s[cheap]

Edge S7    18900
HTC M1     18000
dtype: int64

In [66]:
s['IPhone'] = 20000

In [67]:
s

Edge S7    18900
HTC M1     18000
IPhone     20000
dtype: int64

In [70]:
s[s < 20000] = s[s < 20000] * 0.8

In [71]:
s

Edge S7    15120
HTC M1     14400
IPhone     20000
dtype: int64

In [73]:
'IPhone' in s

True

In [74]:
'mi' in s

False

In [76]:
s *0.8

Edge S7    12096.0
HTC M1     11520.0
IPhone     16000.0
dtype: float64

In [77]:
import numpy as np
np.sqrt(s)

Edge S7    122.963409
HTC M1     120.000000
IPhone     141.421356
dtype: float64

In [79]:
s.max()

20000

In [80]:
s.min()

14400

In [81]:
s.describe()

count        3.000000
mean     16506.666667
std       3046.659373
min      14400.000000
25%      14760.000000
50%      15120.000000
75%      17560.000000
max      20000.000000
dtype: float64

In [83]:
s[['mi','HTC M1']]

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\series.py:705: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self.loc[key]

mi            NaN
HTC M1    14400.0
dtype: float64

In [85]:
s[['IPhone', 'HTC M1']]

IPhone    20000
HTC M1    14400
dtype: int64

In [86]:
s[['mi','HTC M1']] + s[['IPhone', 'HTC M1']]

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\series.py:705: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self.loc[key]

HTC M1    28800.0
IPhone        NaN
mi            NaN
dtype: float64

In [87]:
s2 = s[['mi','HTC M1']] + s[['IPhone', 'HTC M1']]

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\series.py:705: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self.loc[key]

In [89]:
s2.notnull()

HTC M1     True
IPhone    False
mi        False
dtype: bool

In [90]:
s2.isnull()

HTC M1    False
IPhone     True
mi         True
dtype: bool

## DataFrame

In [91]:
df=pd.DataFrame([['frank','M',29],['mary','F',23],['tom','M',35],['ted','M',33],['jean','F',21],['lisa','F',20]])
df.columns=['name','gender','age']

In [92]:
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [93]:
df=pd.DataFrame([['frank','M',29],['mary','F',23],['tom','M',35],['ted','M',33],['jean','F',21],['lisa','F',20]],columns=['name','gender','age'])

In [94]:
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [98]:
df=pd.DataFrame([{'name':'frank','gender':'M','age':29},\
                 {'name':'mary','gender':'F','age':23},\
                 {'name':'tom','gender':'M','age':35},\
                 {'name':'ted','gender':'M','age':33},\
                 {'name':'jean','gender':'F','age':21},\
                 {'name':'lisa','gender':'F','age':20}])
df

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa

In [97]:
a = {'name':'qoo', 'gender': 'M', 'age': 20}
b = {'name':'Mary', 'gender': 'F'}
df2 = pd.DataFrame([a,b])
df2

    age gender  name
0  20.0      M   qoo
1   NaN      F  Mary

In [99]:
df.head()

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean

In [100]:
df.head(3)

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom

In [101]:
df.tail(5)

   age gender  name
1   23      F  mary
2   35      M   tom
3   33      M   ted
4   21      F  jean
5   20      F  lisa

In [102]:
df.tail(3)

   age gender  name
3   33      M   ted
4   21      F  jean
5   20      F  lisa

In [103]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
age       6 non-null int64
gender    6 non-null object
name      6 non-null object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [104]:
df.describe()

             age
count   6.000000
mean   26.833333
std     6.400521
min    20.000000
25%    21.500000
50%    26.000000
75%    32.000000
max    35.000000

In [105]:
df.dtypes

age        int64
gender    object
name      object
dtype: object

In [106]:
df.ix[1]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

age         23
gender       F
name      mary
Name: 1, dtype: object

In [109]:
df.iloc[2]

age        35
gender      M
name      tom
Name: 2, dtype: object

In [110]:
df.loc[2]

age        35
gender      M
name      tom
Name: 2, dtype: object

In [112]:
df.index = range(101,107)
df

     age gender   name
101   29      M  frank
102   23      F   mary
103   35      M    tom
104   33      M    ted
105   21      F   jean
106   20      F   lisa

In [115]:
df.index

RangeIndex(start=101, stop=107, step=1)

In [113]:
df.iloc[2]

age        35
gender      M
name      tom
Name: 103, dtype: object

In [116]:
df.loc[103]

age        35
gender      M
name      tom
Name: 103, dtype: object

In [118]:
df['name']

101    frank
102     mary
103      tom
104      ted
105     jean
106     lisa
Name: name, dtype: object

In [119]:
df[['name', 'age']]

      name  age
101  frank   29
102   mary   23
103    tom   35
104    ted   33
105   jean   21
106   lisa   20

In [121]:
# loc => by index name
df.loc[ [101,102] , ['name', 'age']   ]

      name  age
101  frank   29
102   mary   23

In [124]:
# iloc => by index position
df.iloc[1:3, [1,2]]

    gender  name
102      F  mary
103      M   tom

In [129]:
df['gender'] == 'M'

101     True
102    False
103     True
104     True
105    False
106    False
Name: gender, dtype: bool

In [128]:
df[df['gender'] == 'M']

     age gender   name
101   29      M  frank
103   35      M    tom
104   33      M    ted

In [131]:
df['gender'] == 'M'

101     True
102    False
103     True
104     True
105    False
106    False
Name: gender, dtype: bool

In [132]:
df['age'] >= 30

101    False
102    False
103     True
104     True
105    False
106    False
Name: age, dtype: bool

In [134]:
(df['gender'] == 'M') & (df['age'] >= 30)

101    False
102    False
103     True
104     True
105    False
106    False
dtype: bool

In [135]:
df[(df['gender'] == 'M') & (df['age'] >= 30)]

     age gender name
103   35      M  tom
104   33      M  ted

In [136]:
(df['gender'] == 'M') | (df['age'] >= 30)

101     True
102    False
103     True
104     True
105    False
106    False
dtype: bool

In [137]:
df[(df['gender'] == 'M') | (df['age'] >= 30)]

     age gender   name
101   29      M  frank
103   35      M    tom
104   33      M    ted

In [139]:
df['employee'] = True

In [140]:
df

     age gender   name  employee
101   29      M  frank      True
102   23      F   mary      True
103   35      M    tom      True
104   33      M    ted      True
105   21      F   jean      True
106   20      F   lisa      True

In [141]:
del df['employee']

In [142]:
df

     age gender   name
101   29      M  frank
102   23      F   mary
103   35      M    tom
104   33      M    ted
105   21      F   jean
106   20      F   lisa

In [143]:
df['employee'] = True
df

     age gender   name  employee
101   29      M  frank      True
102   23      F   mary      True
103   35      M    tom      True
104   33      M    ted      True
105   21      F   jean      True
106   20      F   lisa      True

In [146]:
# method 1
#df = df.drop('employee', axis = 1)

# method 2
df.drop('employee', axis = 1, inplace=True)

In [148]:
# by name
df.loc[6]={'age':20,'gender':'F','name':'qoo'}
df

     age gender   name
101   29      M  frank
102   23      F   mary
103   35      M    tom
104   33      M    ted
105   21      F   jean
106   20      F   lisa
6     20      F    qoo

In [151]:
df.append(pd.DataFrame([{'age':30,'gender':'F','name':'oop'}]),ignore_index=True)

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa
6   20      F    qoo
7   30      F    oop

In [154]:
df = df.append(pd.DataFrame([{'age':30,'gender':'F','name':'oop'}]),ignore_index=False)

In [157]:
df.drop(6, inplace=True)

In [160]:
df.drop(0, inplace=True)

In [161]:
df

     age gender   name
101   29      M  frank
102   23      F   mary
103   35      M    tom
104   33      M    ted
105   21      F   jean
106   20      F   lisa

In [162]:
df['userid'] = range(101,107)
df

     age gender   name  userid
101   29      M  frank     101
102   23      F   mary     102
103   35      M    tom     103
104   33      M    ted     104
105   21      F   jean     105
106   20      F   lisa     106

In [163]:
df.set_index('userid', inplace=True)

In [164]:
df

        age gender   name
userid
101      29      M  frank
102      23      F   mary
103      35      M    tom
104      33      M    ted
105      21      F   jean
106      20      F   lisa

In [165]:
# iloc : by pos
# loc  : by name

In [166]:
df.iloc[1]

age         23
gender       F
name      mary
Name: 102, dtype: object

In [168]:
df.iloc[[1,3,5]]

        age gender  name
userid
102      23      F  mary
104      33      M   ted
106      20      F  lisa

In [170]:
df.loc[[101,103,105]]

        age gender   name
userid
101      29      M  frank
103      35      M    tom
105      21      F   jean

In [176]:
df.loc[ df['gender']=='M' , ['gender', 'age'] ]

       gender  age
userid
101         M   29
103         M   35
104         M   33

## 處理缺失值

In [177]:
import pandas as pd
import numpy as np

df=pd.DataFrame([\
                 ['frank','M',np.nan],\
                 ['mary',np.nan,np.nan],\
                 ['tom','M',35],\
                 ['ted','M',33],\
                 ['jean',np.nan,21],\
                 ['lisa','F',20]])

df.columns=['name','gender','age']

df

    name gender   age
0  frank      M   NaN
1   mary    NaN   NaN
2    tom      M  35.0
3    ted      M  33.0
4   jean    NaN  21.0
5   lisa      F  20.0

In [179]:
df['age'].sum()

109.0

In [180]:
df['gender'].notnull()

0     True
1    False
2     True
3     True
4    False
5     True
Name: gender, dtype: bool

In [181]:
df['gender'].isnull()

0    False
1     True
2    False
3    False
4     True
5    False
Name: gender, dtype: bool

In [182]:
# recommended method
df['name']

0    frank
1     mary
2      tom
3      ted
4     jean
5     lisa
Name: name, dtype: object

In [183]:
# not recommended
df.name

0    frank
1     mary
2      tom
3      ted
4     jean
5     lisa
Name: name, dtype: object

In [185]:
df['name'].isnull().values.any()

False

In [186]:
df.isnull().values.any()

True

In [187]:
df.isnull().sum()

name      0
gender    2
age       2
dtype: int64

In [188]:
df.isnull().sum().sum()

4

In [194]:
df.dropna()

# df = df.dropna()
# df.dropna(inplace=True)

   name gender   age
2   tom      M  35.0
3   ted      M  33.0
5  lisa      F  20.0

In [196]:
df.dropna(how = 'all')

    name gender   age
0  frank      M   NaN
1   mary    NaN   NaN
2    tom      M  35.0
3    ted      M  33.0
4   jean    NaN  21.0
5   lisa      F  20.0

In [197]:
df.dropna(thresh = 2)

    name gender   age
0  frank      M   NaN
2    tom      M  35.0
3    ted      M  33.0
4   jean    NaN  21.0
5   lisa      F  20.0

In [198]:
df['employee'] = np.nan

In [199]:
df

    name gender   age  employee
0  frank      M   NaN       NaN
1   mary    NaN   NaN       NaN
2    tom      M  35.0       NaN
3    ted      M  33.0       NaN
4   jean    NaN  21.0       NaN
5   lisa      F  20.0       NaN

In [202]:
# axis: 0 by row, 1 by col  ; default axis :0
df.dropna(axis = 1, how = 'all', inplace=True)

In [204]:
df.fillna(0)

    name gender   age
0  frank      M   0.0
1   mary      0   0.0
2    tom      M  35.0
3    ted      M  33.0
4   jean      0  21.0
5   lisa      F  20.0

In [205]:
df['age'].fillna(0)

0     0.0
1     0.0
2    35.0
3    33.0
4    21.0
5    20.0
Name: age, dtype: float64

In [208]:
df['age'].fillna(df['age'].mean())

0    27.25
1    27.25
2    35.00
3    33.00
4    21.00
5    20.00
Name: age, dtype: float64

In [210]:
# select gender, avg(age) from df group by gender
df.groupby('gender')['age'].mean()

gender
F    20.0
M    34.0
Name: age, dtype: float64

In [212]:
df.groupby('gender')['age'].transform('mean')

0    34.0
1     NaN
2    34.0
3    34.0
4     NaN
5    20.0
Name: age, dtype: float64

In [214]:
df['age'].fillna(df.groupby('gender')['age'].transform('mean'))

0    34.0
1     NaN
2    35.0
3    33.0
4    21.0
5    20.0
Name: age, dtype: float64

In [216]:
df

    name gender   age
0  frank      M   NaN
1   mary    NaN   NaN
2    tom      M  35.0
3    ted      M  33.0
4   jean    NaN  21.0
5   lisa      F  20.0

In [215]:
df.fillna(method='pad')

    name gender   age
0  frank      M   NaN
1   mary      M   NaN
2    tom      M  35.0
3    ted      M  33.0
4   jean      M  21.0
5   lisa      F  20.0

In [217]:
df.fillna(method='bfill')

    name gender   age
0  frank      M  35.0
1   mary      M  35.0
2    tom      M  35.0
3    ted      M  33.0
4   jean      F  21.0
5   lisa      F  20.0

In [218]:
df.fillna(method='bfill', limit = 1)

    name gender   age
0  frank      M   NaN
1   mary      M  35.0
2    tom      M  35.0
3    ted      M  33.0
4   jean      F  21.0
5   lisa      F  20.0

In [219]:
df2=pd.DataFrame([[1,870],\
                  [2,900],\
                  [np.nan,np.nan],\
                  [4,950],\
                  [5,1080],\
                  [6,1200]])
df2.columns=['time','val']
df2.interpolate()

   time     val
0   1.0   870.0
1   2.0   900.0
2   3.0   925.0
3   4.0   950.0
4   5.0  1080.0
5   6.0  1200.0

## 數據轉換

In [223]:
import pandas
df = pandas.read_csv('https://raw.githubusercontent.com/ywchiu/tibamepy/master/data/rent_591_sample.csv',index_col=0)
df.head()

,id,address,floor,allfloor,layout,area,price,browsenum_all
0,6032971,永康街47巷永康街五樓頂加..,5,5,5房3廳3衛,46.8,"60,000",751
1,6054083,仁愛路四段仁愛路樹海景觀..,7,12,4房2廳2衛,76.9,"100,000",162
2,5957980,光復南路高樓層大巨蛋正對..,10,13,4房2廳2衛,71.3,"150,000",2385
3,6043839,永康街23巷永康商圈..,3,4,2房1廳1衛,18.0,"29,000",1323
4,5181793,雲和街師大*已收訂..,5,5,2房2廳1衛,28.0,"31,800",2303

In [226]:
df['area'].head() / 0.3025

0    154.710744
1    254.214876
2    235.702479
3     59.504132
4     92.561983
Name: area, dtype: float64

In [227]:
import numpy as np
np.sqrt(df['area'].head())

0    6.841053
1    8.769265
2    8.443933
3    4.242641
4    5.291503
Name: area, dtype: float64

In [228]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 720 entries, 0 to 29
Data columns (total 8 columns):
id               720 non-null int64
address          720 non-null object
floor            720 non-null int64
allfloor         720 non-null int64
layout           720 non-null object
area             720 non-null float64
price            720 non-null object
browsenum_all    720 non-null int64
dtypes: float64(1), int64(4), object(3)
memory usage: 70.6+ KB

In [230]:
df['address'].head() + '-' + df['price'].head()

0    永康街47巷永康街五樓頂加..-60,000
1    仁愛路四段仁愛路樹海景觀..-100,000
2    光復南路高樓層大巨蛋正對..-150,000
3       永康街23巷永康商圈..-29,000
4        雲和街師大*已收訂..-31,800
dtype: object

In [231]:
df['square_feet']=df['area']/0.3025

In [232]:
df.head()

,id,address,floor,allfloor,layout,area,price,browsenum_all,square_feet
0,6032971,永康街47巷永康街五樓頂加..,5,5,5房3廳3衛,46.8,"60,000",751,154.710744
1,6054083,仁愛路四段仁愛路樹海景觀..,7,12,4房2廳2衛,76.9,"100,000",162,254.214876
2,5957980,光復南路高樓層大巨蛋正對..,10,13,4房2廳2衛,71.3,"150,000",2385,235.702479
3,6043839,永康街23巷永康商圈..,3,4,2房1廳1衛,18.0,"29,000",1323,59.504132
4,5181793,雲和街師大*已收訂..,5,5,2房2廳1衛,28.0,"31,800",2303,92.561983

In [236]:
p = '60,000'
int(p.replace(',', ''))

60000

In [237]:
def normalizePrice(ele):
    return int(ele.replace(',', ''))

In [240]:
df['price'].map(normalizePrice).head()

0     60000
1    100000
2    150000
3     29000
4     31800
Name: price, dtype: int64

In [241]:
df['price'].map(lambda ele: int(ele.replace(',', ''))).head()

0     60000
1    100000
2    150000
3     29000
4     31800
Name: price, dtype: int64

In [247]:
df=pandas.DataFrame([[60,70,50],\
                      [80,79,68],\
                      [63,66,82]],\
                    columns=['First','Second','Third'])

In [252]:
df.apply(lambda e: e.max() - e.min(), axis=1)

0    20
1    12
2    19
dtype: int64

In [253]:
df.apply(lambda e: e.max() - e.min(), axis=0)

First     20
Second    13
Third     32
dtype: int64

In [255]:
df.applymap(lambda e: e * 10)

   First  Second  Third
0    600     700    500
1    800     790    680
2    630     660    820

## 處理時間格式資料

In [256]:
from datetime import datetime
current_time = datetime.now()

In [257]:
current_time

datetime.datetime(2018, 4, 22, 13, 58, 28, 544631)

In [258]:
current_time.strftime('%Y-%m-%d')

'2018-04-22'

In [260]:
dt = datetime.strptime('2018/01/05', '%Y/%m/%d')

In [261]:
current_time - dt

datetime.timedelta(107, 50308, 544631)

In [264]:
from datetime import datetime, timedelta

current_time - timedelta(days = 1)

datetime.datetime(2018, 4, 21, 13, 58, 28, 544631)

In [267]:
for i in range(0,10):
    #print(current_time - timedelta(days = i))
    dt = current_time - timedelta(days = i)
    print(dt.strftime('%Y/%m/%d'))

2018/04/22
2018/04/21
2018/04/20
2018/04/19
2018/04/18
2018/04/17
2018/04/16
2018/04/15
2018/04/14
2018/04/13

In [270]:
from time import mktime
mktime(current_time.timetuple())

1524376708.0

In [271]:
datetime.fromtimestamp(1524376708)

datetime.datetime(2018, 4, 22, 13, 58, 28)

In [280]:
datetime.fromtimestamp(86400)

datetime.datetime(1970, 1, 2, 8, 0)

In [282]:
import pandas
df = pandas.read_csv('https://raw.githubusercontent.com/ywchiu/tibamepy/master/data/rent_591_sample.csv',index_col=0)
df.head()

,id,address,floor,allfloor,layout,area,price,browsenum_all
0,6032971,永康街47巷永康街五樓頂加..,5,5,5房3廳3衛,46.8,"60,000",751
1,6054083,仁愛路四段仁愛路樹海景觀..,7,12,4房2廳2衛,76.9,"100,000",162
2,5957980,光復南路高樓層大巨蛋正對..,10,13,4房2廳2衛,71.3,"150,000",2385
3,6043839,永康街23巷永康商圈..,3,4,2房1廳1衛,18.0,"29,000",1323
4,5181793,雲和街師大*已收訂..,5,5,2房2廳1衛,28.0,"31,800",2303

In [283]:
df['search_date'] = '2018/04/22'

In [284]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 720 entries, 0 to 29
Data columns (total 9 columns):
id               720 non-null int64
address          720 non-null object
floor            720 non-null int64
allfloor         720 non-null int64
layout           720 non-null object
area             720 non-null float64
price            720 non-null object
browsenum_all    720 non-null int64
search_date      720 non-null object
dtypes: float64(1), int64(4), object(4)
memory usage: 56.2+ KB

In [288]:
pandas.to_datetime(df['search_date'], format = '%Y/%m/%d').head()

0   2018-04-22
1   2018-04-22
2   2018-04-22
3   2018-04-22
4   2018-04-22
Name: search_date, dtype: datetime64[ns]

## 虛擬變量

In [307]:
import pandas
df = pandas.read_csv('https://raw.githubusercontent.com/ywchiu/tibamepy/master/data/rent_591_sample2.csv', index_col = 0)

In [308]:
df.head(3)

,detail_url,search_date,title,address,floor_info,price,layout,building_area,building_use,latitude,longitude
0,https://rent.591.com.tw/rent-detail-1050934.html,2017-05-14,套房出租-近東方學院(六~八月可入住),高雄市湖內區民生街,3F/3F,"4,500元/月",NaN,6.0,透天厝/獨立套房,22.878436,120.250810
1,https://rent.591.com.tw/rent-detail-1008046.html,2017-05-14,好房子【聰明的你、妳快來租吧】,新北市蘆洲區長安街,4F/5F,"7,500元/月",NaN,10.0,透天厝/獨立套房,25.081558,121.461868
2,https://rent.591.com.tw/rent-detail-1586266.html,2017-05-12,陽台大套房(獨立洗衣機)近頂溪捷運站,新北市永和區中山路一段,8F/12F,"11,000元/月",NaN,8.0,電梯大樓/分租套房,25.010293,121.511328

In [309]:
df_cols = pd.get_dummies(df['building_use'])

In [310]:
df3 = pd.concat([df, df_cols], axis = 1)

In [311]:
df4 = df.drop('building_area', axis = 1)

In [313]:
df['price'] = df['price'].map(lambda e: int(e.replace('元/月', '').replace(',', '')))

In [316]:
df2 = df.pivot_table(index='search_date',columns='building_use',values='price',aggfunc=sum)

In [322]:
#df2.T

In [317]:
df5=df.pivot_table(index='building_use',columns='search_date',values='price',aggfunc=sum)

In [319]:
df5.head()

search_date,2017-05-08,2017-05-09,2017-05-10,2017-05-11,2017-05-12,2017-05-13,2017-05-14,2017-05-15
building_use,,,,,,,,
倉庫/其他,72325.0,236744.0,63748.0,108200.0,60800.0,231348.0,590250.0,NaN
公寓/住辦,371500.0,159000.0,494800.0,242600.0,1096300.0,1600499.0,1487800.0,421500.0
公寓/其他,58500.0,42999.0,NaN,11000.0,75000.0,234300.0,143000.0,NaN
公寓/分租套房,1224399.0,1579138.0,2035480.0,1643348.0,4318694.0,6571657.0,5744947.0,14800.0
公寓/店面,4490600.0,3362400.0,7132600.0,4824099.0,10924080.0,24972598.0,20999686.0,4686200.0

In [323]:
df['building_use'].head()

0     透天厝/獨立套房
1     透天厝/獨立套房
2    電梯大樓/分租套房
3     透天厝/獨立套房
4     透天厝/分租套房
Name: building_use, dtype: object

In [325]:
df['btype']=df['building_use'].map(lambda e:str(e).split('/')[0])
df['buse']=df['building_use'].map(lambda e:str(e).split('/')[1] \
                        if len(str(e).split('/')) >1 else None)

In [328]:
df_multi_idx=df.pivot_table(index=['btype','buse'],columns='search_date',values='price',aggfunc=sum)

In [330]:
df_multi_idx.head(10)

search_date  2017-05-08  2017-05-09  2017-05-10  2017-05-11  2017-05-12  \
btype buse
倉庫    其他        72325.0    236744.0     63748.0    108200.0     60800.0
公寓    住辦       371500.0    159000.0    494800.0    242600.0   1096300.0
      其他        58500.0     42999.0         NaN     11000.0     75000.0
      分租套房    1224399.0   1579138.0   2035480.0   1643348.0   4318694.0
      店面      4490600.0   3362400.0   7132600.0   4824099.0  10924080.0
      整層住家    4241986.0   4206235.0   5572385.0   5068078.0   7866946.0
      獨立套房    2321837.0   3048561.0   5193507.0   3147599.0   9554327.0
      辦公      1173780.0    855900.0   1165900.0    464000.0   2882900.0
      雅房       401067.0    366199.0    493833.0    583450.0   1069600.0
其他    其他         6000.0         NaN         NaN      3500.0         NaN

search_date  2017-05-13  2017-05-14  2017-05-15
btype buse
倉庫    其他       231348.0    590250.0         NaN
公寓    住辦      1600499.0   1487800.0    421500.0
      其他       234300.0    143000.0         NaN
      分租套房    6571657.0   5744947.0     14800.0
      店面     24972598.0  20999686.0   4686200.0
      整層住家   16903735.0  13236495.0    194800.0
      獨立套房   11732422.0   9303486.0     65800.0
      辦公      3916903.0   1332610.0    980994.0
      雅房      1544587.0   2324022.0     10400.0
其他    其他            NaN      7600.0         NaN

In [332]:
df_wide=df_multi_idx.unstack()
df_wide.head()
df_wide

search_date 2017-05-08                                               \
buse                住辦        其他       分租套房          店面        整層住家
btype
倉庫                 NaN   72325.0        NaN         NaN         NaN
公寓            371500.0   58500.0  1224399.0   4490600.0   4241986.0
其他                 NaN    6000.0        NaN         NaN         NaN
別墅             60000.0   27000.0    35800.0     70000.0   1743000.0
廠房                 NaN  116000.0        NaN         NaN         NaN
廠辦                 NaN       NaN        NaN         NaN         NaN
透天厝           465000.0   53500.0   645234.0   5864299.0   2312098.0
電梯大樓         1110800.0  177814.0   453899.0  10574484.0  31536697.0

search_date                                  2017-05-09             ...     \
buse              獨立套房          辦公        雅房         住辦        其他   ...
btype                                                               ...
倉庫                 NaN         NaN       NaN        NaN  236744.0   ...
公寓           2321837.0   1173780.0  401067.0   159000.0   42999.0   ...
其他                 NaN         NaN       NaN        NaN       NaN   ...
別墅            149348.0         NaN    4000.0        NaN  114800.0   ...
廠房                 NaN         NaN       NaN        NaN   45000.0   ...
廠辦                 NaN         NaN       NaN        NaN       NaN   ...
透天厝          2840144.0    121000.0  203499.0   125000.0  158000.0   ...
電梯大樓         5276459.0  21835522.0  105900.0   968399.0  579000.0   ...

search_date   2017-05-14            2017-05-15                                \
buse                  辦公         雅房         住辦       其他     分租套房          店面
btype
倉庫                   NaN        NaN        NaN      NaN      NaN         NaN
公寓             1332610.0  2324022.0   421500.0      NaN  14800.0   4686200.0
其他                   NaN        NaN        NaN      NaN      NaN         NaN
別墅                   NaN    68480.0   139800.0      NaN   7500.0    155000.0
廠房                   NaN        NaN        NaN      NaN      NaN         NaN
廠辦                   NaN        NaN        NaN      NaN      NaN         NaN
透天厝            1590700.0  1399476.0  1139500.0  48000.0  38499.0  13426988.0
電梯大樓         119616166.0   868095.0  2786000.0      NaN   5000.0  17015807.0

search_date
buse             整層住家      獨立套房          辦公       雅房
btype
倉庫                NaN       NaN         NaN      NaN
公寓           194800.0   65800.0    980994.0  10400.0
其他                NaN       NaN         NaN      NaN
別墅           351000.0    9900.0         NaN      NaN
廠房                NaN       NaN         NaN      NaN
廠辦                NaN       NaN         NaN      NaN
透天厝           59000.0  146000.0    699900.0  34800.0
電梯大樓         763800.0  131800.0  45455998.0   5000.0

[8 rows x 64 columns]

In [333]:
df_long=df_wide.stack()
df_long.head()

search_date  2017-05-08  2017-05-09  2017-05-10  2017-05-11  2017-05-12  \
btype buse
倉庫    其他        72325.0    236744.0     63748.0    108200.0     60800.0
公寓    住辦       371500.0    159000.0    494800.0    242600.0   1096300.0
      其他        58500.0     42999.0         NaN     11000.0     75000.0
      分租套房    1224399.0   1579138.0   2035480.0   1643348.0   4318694.0
      店面      4490600.0   3362400.0   7132600.0   4824099.0  10924080.0

search_date  2017-05-13  2017-05-14  2017-05-15
btype buse
倉庫    其他       231348.0    590250.0         NaN
公寓    住辦      1600499.0   1487800.0    421500.0
      其他       234300.0    143000.0         NaN
      分租套房    6571657.0   5744947.0     14800.0
      店面     24972598.0  20999686.0   4686200.0

## 正規表達法

In [334]:
'0912345678' in 'this is a long text with personal phone number: 0912345678'

True

In [335]:
import re
s = '5'
re.match('5', s)

In [336]:
s = '6'
re.match('5', s)

In [337]:
# [] match any character within []
s = '6'
re.match('[0123456789]', s)

In [339]:
s = '6'
# - : continues ; [0-9] == [0123456789]
re.match('[0-9]', s)

In [340]:
s = '6'
# \d: \d == [0-9]
re.match('\d', s)

In [341]:
s = 'w'
re.match('\d', s)

In [342]:
re.match('[abcdefghijklmnopqrstuvwxyz]', s)

In [343]:
re.match('[a-z]', s)

In [344]:
s = 'Y'
re.match('[a-z]', s)

In [345]:
re.match('[a-zA-Z]', s)

In [346]:
s = '3'
re.match('[a-zA-Z0-9]', s)

In [347]:
# \w; \w == [a-zA-Z0-9]
re.match('\w', s)

In [348]:
s= 'apple'
re.match('\w', s)

In [349]:
# {n}: match n characters
re.match('\w{5}', s)

In [350]:
# {m,n} match at least m word, at most n word
s= 'appledaily'
re.match('\w{5,10}', s)

In [353]:
re.match('\w{1,}', s)

In [354]:
# +: {1,} == +
re.match('\w+', s)

In [355]:
re.match('\w{0,}', s)

In [356]:
# *: {0,} == *
re.match('\w*', s)

### 比對電話號碼

In [360]:
phones = ['0912345678', '0912-345678', '0912-345-678', '091238192802384230482340']
for p in phones:
    #print(re.match('09\d{8}',p))
    #print(re.match('09\d{2}-{0,1}\d{3}-{0,1}\d{3}',p))
    
    # ?: ? == {0,1}
    #print(re.match('09\d{2}-?\d{3}-?\d{3}',p))
    
    # ^: match the begining ; $: match the end
    print(re.match('^09\d{2}-?\d{3}-?\d{3}$',p))

<_sre.SRE_Match object; span=(0, 10), match='0912345678'>
<_sre.SRE_Match object; span=(0, 11), match='0912-345678'>
<_sre.SRE_Match object; span=(0, 12), match='0912-345-678'>
None

### 正規表達法範例

In [366]:
import re
email = 'david@largitdata.com'
# (): extract text that matchs the pattern within ()
m = re.match('(\w+)@(\w+)',email)
print(m.groups())
print(m.group(0))
print(m.group(1))
print(m.group(2))

('david', 'largitdata')
david@largitdata
david
largitdata

In [367]:
email = 'david@largitdata.com'
# (): extract text that matchs the pattern within ()
m = re.match('(\w+)@([\w.]+)',email)
print(m.groups())

('david', 'largitdata.com')

In [368]:
# \: escape
m=re.match("(\d+)\.(\d+)","1999.5")
print(m.groups())

('1999', '5')

In [370]:
name = 'David Chiu'
m=re.match("(\w+) (\w+)",name)
print(m.groups())
print(m.group(1))
print(m.group(2))

('David', 'Chiu')
David
Chiu

In [373]:
m = re.match("(?P<first_name>\w+) (?P<last_name>\w+)", name)
print(m.group('first_name'))
print(m.group('last_name'))

David
Chiu

In [374]:
str1='scp file.txt root@10.0.0.1:./'

m=re.match('^scp ([\w.]+) (\w+)@([\d.]+):(.+)',str1)

if m:
    print(m.group(1),m.group(2),m.group(3),m.group(4))

file.txt root 10.0.0.1 ./

In [378]:
df[['bedroom', 'livingroom', 'bathroom', 'balcony']]  = df['layout'].str.extract('(\d+)房(\d+)廳(\d+)衛(\d+)陽臺')

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: currently extract(expand=None) means expand=False (return Index/Series/DataFrame) but in a future version of pandas this will be changed to expand=True (return DataFrame)
  """Entry point for launching an IPython kernel.

In [391]:
df['address'].str.extract('(.+[市縣])(.+[區鎮鄉市])(.+[街路村]).*').head()

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: currently extract(expand=None) means expand=False (return Index/Series/DataFrame) but in a future version of pandas this will be changed to expand=True (return DataFrame)
  """Entry point for launching an IPython kernel.

     0    1    2
0  高雄市  湖內區  民生街
1  新北市  蘆洲區  長安街
2  新北市  永和區  中山路
3  屏東縣  潮州鎮  六合路
4  桃園市  觀音區  四維路

## Pandas IO

In [399]:
m_cols=['Time','Action','User','Product','Quantity','Price']
orders=pandas.read_csv('https://raw.githubusercontent.com/ywchiu/tibamepy/master/data/purchase_order.tab', sep= '\t', names = m_cols, parse_dates= {'Dates':[0]} )
orders.tail()

                    Dates Action        User         Product  Quantity   Price
54767 2015-07-30 23:58:53  order   U18517004     P0006036273         1  2899.0
54768 2015-07-30 23:59:24  order  U217552746     P0010409991         1   253.0
54769 2015-07-30 23:59:33  order  U395036534     P0025123755         1   690.0
54770 2015-07-30 23:59:37  order   U14085643  P0009890670031         1   245.0
54771 2015-07-30 23:59:56  order   U33015290     P0014252055         1  1493.0

In [400]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54772 entries, 0 to 54771
Data columns (total 6 columns):
Dates       54772 non-null datetime64[ns]
Action      54772 non-null object
User        54772 non-null object
Product     54772 non-null object
Quantity    54772 non-null int64
Price       54721 non-null float64
dtypes: datetime64[ns](1), float64(1), int64(1), object(3)
memory usage: 2.5+ MB

In [401]:
orders.to_csv('orders.csv')

In [402]:
orders.to_excel('orders.xlsx')

In [404]:
orders.head(3).to_json()

'{"Dates":{"0":1435708801000,"1":1435708803000,"2":1435708819000},"Action":{"0":"order","1":"order","2":"order"},"User":{"0":"U312622727","1":"U239012343","2":"U10007697373"},"Product":{"0":"P0006944501","1":"P0006018073","2":"P0002267974"},"Quantity":{"0":1,"1":1,"2":1},"Price":{"0":1069.0,"1":1680.0,"2":285.0}}'

In [405]:
orders.head(3).T.to_json()

'{"0":{"Dates":1435708801000,"Action":"order","User":"U312622727","Product":"P0006944501","Quantity":1,"Price":1069.0},"1":{"Dates":1435708803000,"Action":"order","User":"U239012343","Product":"P0006018073","Quantity":1,"Price":1680.0},"2":{"Dates":1435708819000,"Action":"order","User":"U10007697373","Product":"P0002267974","Quantity":1,"Price":285.0}}'

In [406]:
pandas.read_clipboard()

                 Dates Action          User         Product  Quantity  Price
0 2015-07-01  00:00:01  order    U312622727     P0006944501         1   1069
1 2015-07-01  00:00:03  order    U239012343     P0006018073         1   1680
2 2015-07-01  00:00:19  order  U10007697373     P0002267974         1    285
3 2015-07-01  00:01:10  order    U296328517     P0016144236         1    550
4 2015-07-01  00:01:36  order    U300884570  P0014516980122         1    249
5 2015-07-01  00:01:48  order    U451050374     P0004134266         1   1780
6 2015-07-01  00:01:58  order    U465124055     P0012662252         1    488
7 2015-07-01  00:02:18  order    U403001364     P0004401294         1    276

In [408]:
df.head(3).to_clipboard()

In [411]:
import requests
headers = {
 'user-agent': 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/65.0.3325.181 Safari/537.36'   
}
res = requests.get('https://goodinfo.tw/StockInfo/StockDetail.asp?STOCK_ID=2330', headers = headers)

In [413]:
res.encoding

'ISO-8859-1'

In [424]:
res.encoding = 'utf-8'

from bs4 import BeautifulSoup
soup = BeautifulSoup(res.text, 'lxml')

In [427]:
tb = soup.select_one('#FINANCE_ASSETS_M')

In [433]:
finance_data = []
for tr in tb.select('tr')[4:]:
    tds = [td.text for td in tr.select('td')]
    finance_data.append(tds)
pandas.DataFrame(finance_data)

      0     1     2     3     4     5    6      7
0  2017  27.8  6.15  3.71  2.09  23.6  163   58.7
1  2016  28.7  6.86  2.58  2.45  26.3  170  53.58
2  2015  33.9  5.17  4.05  2.11  26.2  250  47.11
3  2014    24  7.71  4.44  2.01  30.1  210  40.32
4  2013  19.2  5.71  2.97  7.06  32.9  183  32.69
5  2012    15  5.47  3.96  6.89    24  203   27.9
6  2011  18.5   5.3  3.21  4.45  18.4  212  24.29
7  2010  20.6     6  3.95  5.53  19.5  186  22.16
8  2009  28.8  5.97  3.52  6.36  16.1  202  19.11
9  2008  34.8  3.33  2.66  7.15  14.1  390  18.59

In [443]:
tb = soup.select_one('#FINANCE_ASSETS_M')
dfs = pandas.read_html(tb.prettify())

In [445]:
df = dfs[0]
df.drop([0,1,2,3], inplace=True)
df

       0     1     2     3     4     5      6      7
4   2017  27.8  6.15  3.71  2.09  23.6  163.0  58.70
5   2016  28.7  6.86  2.58  2.45  26.3  170.0  53.58
6   2015  33.9  5.17  4.05  2.11  26.2  250.0  47.11
7   2014    24  7.71  4.44  2.01  30.1  210.0  40.32
8   2013  19.2  5.71  2.97  7.06  32.9  183.0  32.69
9   2012    15  5.47  3.96  6.89  24.0  203.0  27.90
10  2011  18.5   5.3  3.21  4.45  18.4  212.0  24.29
11  2010  20.6     6  3.95  5.53  19.5  186.0  22.16
12  2009  28.8  5.97  3.52  6.36  16.1  202.0  19.11
13  2008  34.8  3.33  2.66  7.15  14.1  390.0  18.59

In [446]:
df.to_html('financial.html')

## Pandas Aggregation

In [450]:
orders[orders['Product'] == 'P0000143511']['Price'].mean()

438888.0

In [452]:
orders.loc[orders['Product'] == 'P0000143511','Price'].mean()

438888.0

In [454]:
# select Product, avg(Price) from orders group by Product
orders.groupby('Product')['Price'].mean().head()

Product
P0000005913       1590.0
P0000006020       1290.0
P0000006591        999.0
P0000007744       3280.0
P0000008190011    5083.0
Name: Price, dtype: float64

In [457]:
# select Product, avg(Price) from orders group by Product order by avg(Price) desc limit 5
orders.groupby('Product')['Price'].mean().sort_values(ascending =False).head()

Product
P0000143511    438888.0
P0000143500    438888.0
P0006584093    320000.0
P0025280275    183900.0
P0000150006    111375.0
Name: Price, dtype: float64

In [458]:
orders.head()

                Dates Action          User         Product  Quantity   Price
0 2015-07-01 00:00:01  order    U312622727     P0006944501         1  1069.0
1 2015-07-01 00:00:03  order    U239012343     P0006018073         1  1680.0
2 2015-07-01 00:00:19  order  U10007697373     P0002267974         1   285.0
3 2015-07-01 00:01:10  order    U296328517     P0016144236         1   550.0
4 2015-07-01 00:01:36  order    U300884570  P0014516980122         1   249.0

In [459]:
orders['total_price'] = orders['Quantity'] * orders['Price']

In [462]:
orders.groupby('User')['total_price'].sum().sort_values(ascending = False).head(3)

User
U166708333      2942744.0
U10120098943    1451117.0
U142809250       747550.0
Name: total_price, dtype: float64

In [463]:
m_cols=['Time','Action','User','Product']
views=pd.read_csv('https://github.com/ywchiu/twmpython/blob/master/dataset/purchase_view.tab?raw=true',sep='\t',parse_dates={'Dates':[0]},names=m_cols,encoding='utf-8')
views.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1191486 entries, 0 to 1191485
Data columns (total 4 columns):
Dates      1191486 non-null datetime64[ns]
Action     1191486 non-null object
User       1191486 non-null object
Product    1191486 non-null object
dtypes: datetime64[ns](1), object(3)
memory usage: 36.4+ MB

In [464]:
orders_cnt=orders.groupby(['User','Product'])['Product'].size().reset_index(name='buys')
views_cnt=views.groupby(['User','Product'])['Product'].size().reset_index(name='views')

In [472]:
a = pandas.DataFrame([{'a':1, 'b':2, 'c': 3}])
b = pandas.DataFrame([{'a':10,  'c': 30, 'd':50}])
a = a.T
b = b.T

In [479]:
pandas.merge(a,b,left_index=True, right_index=True, how = 'inner')

   0_x  0_y
a    1   10
c    3   30

In [480]:
pandas.merge(a,b,left_index=True, right_index=True, how = 'left')

   0_x   0_y
a    1  10.0
b    2   NaN
c    3  30.0

In [481]:
pandas.merge(a,b,left_index=True, right_index=True, how = 'right')

   0_x  0_y
a  1.0   10
c  3.0   30
d  NaN   50

In [482]:
merge_df = pandas.merge(orders_cnt, views_cnt, on = ['User', 'Product'], how='right')

In [486]:
buy = merge_df[merge_df['buys'].notnull()]
notbuy = merge_df[merge_df['buys'].isnull()]

In [495]:
buy['views'].describe()

count    29191.000000
mean         2.734541
std         15.616757
min          1.000000
25%          1.000000
50%          2.000000
75%          3.000000
max       2613.000000
Name: views, dtype: float64

In [496]:
notbuy['views'].describe()

count    742584.000000
mean          1.497019
std           9.552541
min           1.000000
25%           1.000000
50%           1.000000
75%           1.000000
max        3148.000000
Name: views, dtype: float64

## 使用Python 連結資料庫

In [497]:
import sqlite3 as lite
con = lite.connect('test.sqlite')
cur = con.cursor()
cur.execute('SELECT SQLITE_VERSION()')
data = cur.fetchone()
print(data)
con.close()

('3.21.0',)

In [498]:
with lite.connect('test.sqlite') as con:
    cur = con.cursor()
    cur.execute('SELECT SQLITE_VERSION()')
    data = cur.fetchone()
    print(data)

('3.21.0',)

In [500]:
with lite.connect('test.sqlite') as con:
    cur = con.cursor()
    cur.execute("DROP TABLE IF EXISTS PhoneAddress")
    cur.execute("CREATE TABLE PhoneAddress(phone CHAR(10) PRIMARY KEY, address TEXT, name TEXT unique, age INT NOT NULL)")
    cur.execute("INSERT INTO PhoneAddress VALUES('0912173381','United State','JhonDoe',53)")
    cur.execute("INSERT INTO PhoneAddress VALUES('0928375018','Tokyo Japan','MuMuCat',6)")
    cur.execute("INSERT INTO PhoneAddress VALUES('0957209108','Taipei','Richard',29)")
    
    cur.execute("SELECT phone,address FROM PhoneAddress")
    data = cur.fetchall()
    print(data)

[('0912173381', 'United State'), ('0928375018', 'Tokyo Japan'), ('0957209108', 'Taipei')]

In [501]:
with lite.connect('test.sqlite') as con:
    cur = con.cursor()
    cur.execute("DROP TABLE IF EXISTS PhoneAddress")
    cur.execute("CREATE TABLE PhoneAddress(phone CHAR(10) PRIMARY KEY, address TEXT, name TEXT unique, age INT NOT NULL)")
    cur.execute("INSERT INTO PhoneAddress VALUES('0912173381','United State','JhonDoe',53)")
    cur.execute("INSERT INTO PhoneAddress VALUES('0928375018','Tokyo Japan','MuMuCat',6)")
    cur.execute("INSERT INTO PhoneAddress VALUES('0957209108','Taipei','Richard',29)")
    
    cur.execute("SELECT phone,address FROM PhoneAddress")
    data = cur.fetchone()
    print(data)
    
    data2 = cur.fetchall()
    print(data2)

('0912173381', 'United State')
[('0928375018', 'Tokyo Japan'), ('0957209108', 'Taipei')]

In [502]:
employee=[{'name':'Mary','age':23,'gender':'F'},{'name':'John','age':33,'gender':'M'}]
df=pandas.DataFrame(employee)
df

   age gender  name
0   23      F  Mary
1   33      M  John

In [503]:
with lite.connect('test.sqlite') as con:
    df.to_sql('employee', con = con)

In [504]:
with lite.connect('test.sqlite') as con:
    cur = con.cursor()
    cur.execute('SELECT * FROM employee;')
    data = cur.fetchall()
    print(data)

[(0, 23, 'F', 'Mary'), (1, 33, 'M', 'John')]

In [505]:
with lite.connect('test.sqlite') as con:
    df2 = pandas.read_sql_query('SELECT * FROM employee;', con = con)

In [506]:
df2

   index  age gender  name
0      0   23      F  Mary
1      1   33      M  John

## 儲存實例

In [507]:
import pandas
df = pandas.read_csv('https://raw.githubusercontent.com/ywchiu/tibamepy/master/data/rent_591_sample.csv',index_col=0)
df.head()

,id,address,floor,allfloor,layout,area,price,browsenum_all
0,6032971,永康街47巷永康街五樓頂加..,5,5,5房3廳3衛,46.8,"60,000",751
1,6054083,仁愛路四段仁愛路樹海景觀..,7,12,4房2廳2衛,76.9,"100,000",162
2,5957980,光復南路高樓層大巨蛋正對..,10,13,4房2廳2衛,71.3,"150,000",2385
3,6043839,永康街23巷永康商圈..,3,4,2房1廳1衛,18.0,"29,000",1323
4,5181793,雲和街師大*已收訂..,5,5,2房2廳1衛,28.0,"31,800",2303

In [508]:
df['price'] = df['price'].map(lambda e: int(e.replace(',','')))

In [510]:
with lite.connect('test.sqlite') as con:
    df.to_sql('rent_591', con = con, index = None)

In [517]:
with lite.connect('test.sqlite') as con:
    #df2 = pandas.read_sql_query('SELECT * FROM rent_591;', con = con)
    #df2 = pandas.read_sql_query('SELECT * FROM rent_591 WHERE price >= 100000;', con = con)
    #df2 = pandas.read_sql_query('SELECT address, area, price FROM rent_591 WHERE price >= 100000;', con = con)
    #df2 = pandas.read_sql_query('SELECT address, area, price FROM rent_591 WHERE price >= 100000 order by price desc;', con = con)
    #df2 = pandas.read_sql_query('SELECT address, area, price FROM rent_591 WHERE price >= 100000 order by price desc limit 3;', con = con)
    #df2 = pandas.read_sql_query('SELECT floor,avg(price) FROM rent_591 GROUP BY floor;', con = con)
    df2 = pandas.read_sql_query('SELECT floor,avg(price) FROM rent_591 GROUP BY floor HAVING avg(price) >= 80000;', con = con)
    

df2

   floor     avg(price)
0      1  108235.176471
1     15  113442.111111
2     17   85153.076923
3     18  108000.000000
4     22  160000.000000
5     99  173333.000000